# Before you start :
   - These exercises are related to the Pivot table and correlation lessons.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in the `your-code` folder of this lab.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly enjoy the process!!!

#### Import all the libraries that are necessary.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
%matplotlib inline

#### Open the ` Employee.csv` file and name your dataset `employee`.

In [3]:
employee = pd.read_csv('data/Employee.csv')

In [4]:
employee.head()

     Name Department Education Gender      Title  Years  Salary
0    Jose         IT  Bachelor      M    analyst      1      35
1   Maria         IT    Master      F    analyst      2      30
2   David         HR    Master      M    analyst      2      30
3   Sonia         HR  Bachelor      F    analyst      4      35
4  Samuel      Sales    Master      M  associate      3      55

In [21]:
employee.shape

(9, 7)

#### What's the mean salary by department?
Hint : There are 2 ways to do it - one way is with groupby and the other way is with pivot tables. Do it both ways.

In [8]:
# Method 1: groupby

employee.groupby(['Department']).Salary.agg('mean').sort_values(ascending=False)

Department
Sales    55.00
IT       48.75
HR       45.00
Name: Salary, dtype: float64

In [11]:
# Method 2: pivot table
employee.pivot_table(index= ['Department'], values = ['Salary'], aggfunc = ['mean']) #,sort=False)

             mean
           Salary
Department
HR          45.00
IT          48.75
Sales       55.00

In [ ]:
#Â pivot function does not contain aggfunc argument

#### We want now to group the data by more than one column. Use Pandas pivot table function to select the mean salary by department and title.

In [12]:
# Method 2
employee.pivot_table(index= ['Department','Title'], values = ['Salary'], aggfunc = ['mean'])

                       mean
                     Salary
Department Title
HR         VP          70.0
           analyst     32.5
IT         VP          70.0
           analyst     32.5
           associate   60.0
Sales      associate   55.0

In [13]:
employee.groupby(['Department','Title']).Salary.agg('mean') # .sort_values(ascending=False)

Department  Title
HR          VP           70.0
            analyst      32.5
IT          VP           70.0
            analyst      32.5
            associate    60.0
Sales       associate    55.0
Name: Salary, dtype: float64

#### We want to display the number of years of work experience and the salary for each Title. Add Years as a column in your pivot table.
*Hint: Use Pandas doc(see References in README.md) to explore the pivot_table() arguments*

In [19]:
employee.pivot_table(index='Title', values = ['Salary'], columns=['Years']) 
# aggfunc is mean by default

          Salary
Years          1     2     3     4     7     8
Title
VP           NaN   NaN   NaN   NaN   NaN  70.0
analyst     35.0  30.0   NaN  35.0   NaN   NaN
associate    NaN  55.0  55.0   NaN  60.0   NaN

In [20]:
employee.pivot_table(index=['Department','Title'], values = ['Salary'], columns=['Years'])

                     Salary
Years                     1     2     3     4     7     8
Department Title
HR         VP           NaN   NaN   NaN   NaN   NaN  70.0
           analyst      NaN  30.0   NaN  35.0   NaN   NaN
IT         VP           NaN   NaN   NaN   NaN   NaN  70.0
           analyst     35.0  30.0   NaN   NaN   NaN   NaN
           associate    NaN   NaN   NaN   NaN  60.0   NaN
Sales      associate    NaN  55.0  55.0   NaN   NaN   NaN

In [ ]:
# watch years

In [17]:
employee.Years.nunique()

6

In [18]:
employee.Years.unique()

array([1, 2, 4, 3, 8, 7])

#### We want to know the information about the mean salary and number of employees in each department and for each job title.

In [23]:
employee.pivot_table(index=['Department','Title'], 
                     values = ['Salary','Name'], 
                     aggfunc = {'Salary': 'mean','Name':pd.Series.nunique})

                      Name  Salary
Department Title
HR         VP            1    70.0
           analyst       2    32.5
IT         VP            1    70.0
           analyst       2    32.5
           associate     1    60.0
Sales      associate     2    55.0

#### We want to know for each department and for each job title the Salary's median, minimum, maximum and standard deviation. Comment your results.

In [30]:
salary_table = employee.pivot_table(index = ['Department','Title'], 
                     values = 'Salary', 
                     aggfunc = ['median','min','max','std'])
salary_table

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70       NaN
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60       NaN
Sales      associate   55.0     55     55  0.000000

In [ ]:
# There are std 0 and NaN --> ??? why happens that?

#### Based on your comments, fill the missing values with an appropriate value.

In [33]:
salary_table.fillna(0, inplace = True)
salary_table

                     median    min    max       std
                     Salary Salary Salary    Salary
Department Title
HR         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
IT         VP          70.0     70     70  0.000000
           analyst     32.5     30     35  3.535534
           associate   60.0     60     60  0.000000
Sales      associate   55.0     55     55  0.000000

#### The stake holders want to know for each department the number of employees and how much money is spend on salaries. Could you provide that information?

In [35]:
employee.pivot_table(index='Department', 
                     values = ['Name','Salary'], 
                     aggfunc = {'Name':pd.Series.nunique, 'Salary':'sum'})

            Name  Salary
Department
HR             3     135
IT             4     195
Sales          2     110

#### For each Department and Title, we want to know the the total years of work experience and the mean salary.

In [36]:
employee.pivot_table(index=['Department', 'Title'], 
                     values = ['Years','Salary'], 
                     aggfunc = {'Years':'sum', 'Salary':'mean'})

                      Salary  Years
Department Title
HR         VP           70.0      8
           analyst      32.5      6
IT         VP           70.0      8
           analyst      32.5      3
           associate    60.0      7
Sales      associate    55.0      5

### Bonus

#### We now want to compute the mean salary after removing the maxima for each Department. Create the appropriate pivot table.

Hint: Write a custom function.

In [44]:
# get the base table
employee.pivot_table(index = 'Department', values = 'Salary',
                     aggfunc = 'mean')

            Salary
Department
HR           45.00
IT           48.75
Sales        55.00

In [57]:
# define the function
def mean_max(x):
    if len(x) > 1:
        return (sum(x)-max(x))/(len(x)-1)
    else:
        return x[0]/1

In [46]:
test = [2,2,4]

In [47]:
mean_max(test)

2.0

In [58]:
mean_max([5])

5.0

In [50]:
employee.pivot_table(index = 'Department', values = 'Salary',
                     aggfunc = mean_max)

               Salary
Department
HR          32.500000
IT          41.666667
Sales       55.000000

In [54]:
for d in employee.Department.unique():
    print('Department: %s' %(d))
    print(employee.Salary[employee.Department == d])
# employee.Salary[employee.Department == 'HR']

Department: IT
0    35
1    30
6    70
7    60
Name: Salary, dtype: int64
Department: HR
2    30
3    35
8    70
Name: Salary, dtype: int64
Department: Sales
4    55
5    55
Name: Salary, dtype: int64

In [61]:
# test code
employee.pivot_table(index='Department',
                     values = 'Salary',
                     aggfunc = {'Salary': pd.Series.unique})

ValueError: Must produce aggregated value